"""
@author:ming
@file:crud.py
@time:2021/10/16
"""

s = {10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110}
print("\n-------元素判断------\n")
print("10 in s :", 10 in s)  # 10 in s : True
print("10 not in s :", 10 not in s)  # 10 not in s : False

print("\n-----添加元素-------\n")
# 一次性添加一个元素
s.add(122)
print("s=", s)  # s= {100, 70, 122, 40, 10, 110, 80, 50, 20, 90, 60, 30}
# 一次性添加多个元素
s.update({200, 300, 400})
print("s=", s)  # s= {100, 70, 122, 40, 200, 10, 300, 110, 80, 400, 50, 20, 90, 60, 30}
s.update([12, 13, 14])
print("s=", s)  # s= {100, 70, 122, 40, 200, 10, 300, 12, 110, 13, 80, 400, 50, 14, 20, 90, 60, 30}
s.update(('h', 'i', 'j', 'k',))
print("s=", s)  # s= {'i', 10, 12, 13, 14, 400, 'k', 20, 30, 40, 300, 50, 'j', 60, 70, 200, 80, 90, 100, 110, 'h', 122}

print("\n------删除------\n")
# 删除一个指定元素，元素不穿在就抛出异常
s.remove(100)
print("s=", s)  # s= {'j', 10, 12, 13, 14, 400, 'i', 20, 30, 40, 300, 50, 60, 'h', 70, 200, 80, 'k', 90, 110, 122}
# s.remove(5) # s.remove(5) KeyError: 5
s.discard(5)  # 删除指定的一个元素，元素不存在不会抛出异常
# 一次删除任意一个元素
s.pop()
s.pop()
s.pop()
print("s=", s)  # s= {13, 14, 400, 20, 30, 'j', 40, 300, 50, 'i', 60, 70, 200, 80, 'h', 90, 110, 122}

# 清空集合
s.clear()
print("s=", s)  # s= set()
